In [1]:
import numpy as np

In [2]:
import pandas as pd

In [4]:
d1={
    'City':['Hyderabad','Delhi','Mumbai','Chennai','Lucknow'],
    'Population':[1.5,2,2.5,1.75,1.5]
}

In [5]:
dfcity=pd.DataFrame(d1)

In [6]:
dfcity

        City  Population
0  Hyderabad        1.50
1      Delhi        2.00
2     Mumbai        2.50
3    Chennai        1.75
4    Lucknow        1.50

In [7]:
dfcity['City']

0    Hyderabad
1        Delhi
2       Mumbai
3      Chennai
4      Lucknow
Name: City, dtype: object

In [8]:
dfdummy=pd.get_dummies(dfcity['City'])

In [9]:
dfdummy

   Chennai  Delhi  Hyderabad  Lucknow  Mumbai
0        0      0          1        0       0
1        0      1          0        0       0
2        0      0          0        0       1
3        1      0          0        0       0
4        0      0          0        1       0

In [10]:
dfcity

        City  Population
0  Hyderabad        1.50
1      Delhi        2.00
2     Mumbai        2.50
3    Chennai        1.75
4    Lucknow        1.50

In [11]:
dfcity=pd.concat([dfcity,dfdummy],axis=1)

In [12]:
dfcity

        City  Population  Chennai  Delhi  Hyderabad  Lucknow  Mumbai
0  Hyderabad        1.50        0      0          1        0       0
1      Delhi        2.00        0      1          0        0       0
2     Mumbai        2.50        0      0          0        0       1
3    Chennai        1.75        1      0          0        0       0
4    Lucknow        1.50        0      0          0        1       0

In [13]:
dfcity.drop('City',axis=1,inplace=True) # inplace=True means permanent change

In [15]:
dfcity

   Population  Chennai  Delhi  Hyderabad  Lucknow  Mumbai
0        1.50        0      0          1        0       0
1        2.00        0      1          0        0       0
2        2.50        0      0          0        0       1
3        1.75        1      0          0        0       0
4        1.50        0      0          0        1       0

In [14]:
dfcity.columns

Index(['Population', 'Chennai', 'Delhi', 'Hyderabad', 'Lucknow', 'Mumbai'], dtype='object')

In [17]:
dfcity=dfcity[['Chennai', 'Delhi', 'Hyderabad', 'Lucknow', 'Mumbai','Population']]

In [18]:
dfcity

   Chennai  Delhi  Hyderabad  Lucknow  Mumbai  Population
0        0      0          1        0       0        1.50
1        0      1          0        0       0        2.00
2        0      0          0        0       1        2.50
3        1      0          0        0       0        1.75
4        0      0          0        1       0        1.50